> > I'm seeing this issue running Terraform in AzDO. Using the latest AzureRM provider. Not sure if it's a Terraform issue or an Azure issue.
> 
> I'm also seeing a similar issue in Terraform. It is a little different in that you have to actually want host encryption and switch it on in the Tf, but once you do you get the same error, even though the feature is registered.

I **had** this same issue using  `azurerm_kubernetes_cluster_node_pool` within [terraform](https://registry.terraform.io/providers/hashicorp/azurerm/latest/docs/resources/kubernetes_cluster_node_pool#upgrade_settings). 
```
tf --version
Terraform v1.0.4
on windows_amd64
+ provider registry.terraform.io/hashicorp/azurerm v2.71.0
```

Az CLI: 
``` az version
{
  "azure-cli": "2.23.0",
  "azure-cli-core": "2.23.0",
  "azure-cli-telemetry": "1.0.6",
  "extensions": {
    "ml": "2.0.1a5"
  }
}
```

Azure Resource: 
```
  + resource "azurerm_kubernetes_cluster_node_pool" "windows_node_pool" {
      + availability_zones     = [
          + "1",
          + "2",
        ]
      **+ enable_host_encryption = true**
      + id                     = (known after apply)
      + kubelet_disk_type      = (known after apply)
      + kubernetes_cluster_id  = "<removed>"
      + max_pods               = (known after apply)
      + mode                   = "User"
      + name                   = "win"
      + node_count             = 1
      + orchestrator_version   = (known after apply)
      + os_disk_size_gb        = (known after apply)
      + os_disk_type           = "Managed"
      + os_type                = "Windows"
      + priority               = "Regular"
      + spot_max_price         = -1
      + tags                   = {<removed>}
      + vm_size                = "Standard_D2s_v3"
      + vnet_subnet_id         = "<removed>"
    }
```

Omitted error:
```
azurerm_kubernetes_cluster_node_pool.windows_node_pool: Creating...
╷
│ Error: creating/updating Managed Kubernetes Cluster Node Pool "win" (Resource Group "<removed>"): containerservice.AgentPoolsClient#CreateOrUpdate: Failure sending request: StatusCode=0 -- Original Error: Code="SubscriptionNotEnabledEncryptionAtHost" Message="Subscription does not enable EncryptionAtHost."
│
│   with azurerm_kubernetes_cluster_node_pool.windows_node_pool,
│   on resource_azurerm_kubernetes_cluster_node_pool_windows_node_pool.tf line 1, in resource "azurerm_kubernetes_cluster_node_pool" "windows_node_pool":
│    1: resource "azurerm_kubernetes_cluster_node_pool" "windows_node_pool" {
│
╵
```

I have now resolved this issue and created a cluster with an encrypted VM. I resolved this by enabling encryption at the subscription level, see the MS docs [here!](https://docs.microsoft.com/en-us/azure/virtual-machines/disks-enable-host-based-encryption-portal#prerequisites)
**Note that the registration proccess is not instant, in our case it took approx. 5 minutes to complete**

Enabled using: 
```
Connect-AzAccount
WARNING: TenantId '<removed>' contains more than one active subscription. First one will be selected for further use. To select another subscription, use Set-AzContext.

| Account   | SubscriptionName | TenantId  | Environment |
|-----------|------------------|-----------|-------------|
| <Removed> | <Removed>        | <Removed> | AzureCloud  |

Get-AzProviderFeature -FeatureName "EncryptionAtHost" -ProviderNamespace "Microsoft.Compute"
| FeatureName      | ProviderName      | RegistrationState |
|------------------|-------------------|-------------------|
| EncryptionAtHost | Microsoft.Compute | NotRegistered     |

Register-AzProviderFeature -FeatureName "EncryptionAtHost" -ProviderNamespace "Microsoft.Compute"
| FeatureName      | ProviderName      | RegistrationState |
|------------------|-------------------|-------------------|
| EncryptionAtHost | Microsoft.Compute | Registering       |

Get-AzProviderFeature -FeatureName "EncryptionAtHost" -ProviderNamespace "Microsoft.Compute"
| FeatureName      | ProviderName      | RegistrationState |
|------------------|-------------------|-------------------|
| EncryptionAtHost | Microsoft.Compute | Registered        |
```



Attempt after registering:
```
Terraform will perform the following actions:

  # azurerm_kubernetes_cluster_node_pool.windows_node_pool will be created
  + resource "azurerm_kubernetes_cluster_node_pool" "windows_node_pool" {
      + availability_zones     = [
          + "1",
          + "2",
        ]
      + enable_host_encryption = true
      + id                     = (known after apply)
      + kubelet_disk_type      = (known after apply)
      + kubernetes_cluster_id  = "<removed>"
      + max_pods               = (known after apply)
      + mode                   = "User"
      + name                   = "win"
      + node_count             = 1
      + orchestrator_version   = (known after apply)
      + os_disk_size_gb        = (known after apply)
      + os_disk_type           = "Managed"
      + os_type                = "Windows"
      + priority               = "Regular"
      + spot_max_price         = -1
      + tags                   = { "<removed>" }
      + vm_size                = "Standard_D2s_v3"
      + vnet_subnet_id         = "<removed>"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions in workspace "<removed>"?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

azurerm_kubernetes_cluster_node_pool.windows_node_pool: Creating...
azurerm_kubernetes_cluster_node_pool.windows_node_pool: Still creating... [10s elapsed]
...
...
azurerm_kubernetes_cluster_node_pool.windows_node_pool: Still creating... [6m30s elapsed]
azurerm_kubernetes_cluster_node_pool.windows_node_pool: Creation complete after 6m36s [id=<removed>]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```